// Створити змінні для зберігання температури за Цельсієм та Фаренгейтом.
// Перевести температуру з Цельсія у Фаренгейти за допомогою формули та вивести результат в консоль.




let degCel = prompt("Введіть градуси у цельсіях (Тільки число), які ви хочете перевести у Фарінгейти"); 

let degFar = (degCel * 9/5) + 32;
alert("Це дорівнює " + degFar + " у Фарінгейтах");


// Створити змінну для зберігання кількості днів у місяці. 
// Обчислити кількість годин та хвилин у цьому місяці за допомогою оператора множення та вивести результат в консоль.


let daysInAMay = 31; 
let hoursInAMay = 31 * 24; 
let minutesInAMay = hoursInAMay * 60; 

alert("В травні " + hoursInAMay + " годин та " + minutesInAMay + " хвилин");



// Створити змінні для зберігання рівня здоров'я та енергії гравця в грі.
//  Зменшити рівень здоров'я та енергії гравця за допомогою операторів віднімання та вивести результат в консоль.

let hp = 100; 
let energy = 50; 

hp = hp - 10; 
energy = energy - 25; 

console.log("Your current HP is " + hp + " and your energy is " + energy); 


// Створити змінну для зберігання суми покупки в магазині.
//  Застосувати знижку в розмірі 10% до цієї суми за допомогою оператора множення та вивести результат в консоль.

let sum = 7528; 
let discount = 10; 

sum = sum - (sum / 100 * discount);

console.log(sum); 


// Створити змінну для зберігання числа з плаваючою комою. 
// Використати метод Math.floor() для округлення числа до меншого та вивести результат в консоль.

let number = 492389483.47823984923; 

console.log(Math.floor(number)); 



// Створити змінну для зберігання рядка, який містить числа з плаваючою комою.
//  Використати метод parseFloat() для перетворення рядка у десяткове число та вивести результат в консоль.


let secondNumber = 4387928.483e-2; 

console.log(parseFloat(secondNumber)); 


// Створити змінну для зберігання рядка, який містить ціле число. Використати метод parseInt()
//  для перетворення рядка уq ціле число та вивести результат в консоль.

let wiki = "3500 - стільки оборотів звершив пульсар з легкою назвою - PSR J0952-0607, поки ти читав цю назву";
//! 707 оборотів на секнду! WOW!


console.log(parseInt(wiki));



// Створити змінну для зберігання числа. Використати метод Math.sqrt() 
// для обчислення квадратного кореня числа та вивести результат в консоль.

let thirdNumber = 948598239849238; 

console.log(Math.sqrt(thirdNumber)); 

// Створити змінні для зберігання цілочисельного значення та рядка з числом у вигляді рядка. 
// Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль. 
// Потім використати метод toString() для перетворення цілочисельного значення у рядок та вивести результат в консоль.



let numberAsString = "123";
let numberAsInteger = parseInt(numberAsString);

console.log("Число після перетворення рядка на число:", numberAsInteger);

let numberAsStringAgain = numberAsInteger.toString();
console.log("Рядок після перетворення числа на рядок:", numberAsStringAgain);
